CSI API ETABS v1

# cSapModelPropLineSpring Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cPropLineSpring PropLineSpring { get; }

    ReadOnly Property PropLineSpring As cPropLineSpring
    	Get

    Dim instance As cSapModel
    Dim value As cPropLineSpring

    value = instance.PropLineSpring

    property cPropLineSpring^ PropLineSpring {
    	cPropLineSpring^ get ();
    }

    abstract PropLineSpring : cPropLineSpring with get

#### Property Value

Type: cPropLineSpring

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com